app/controllers/posts_controller.rb

	def show
		@post = Post.find(params[:id])
		@comments = Comment.where("post_id = "+params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"  WHERE (post_id = 10)

	def create
		@post = Post.new(user_params)
		if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "adsf"], ["created_at", "2014-05-07 07:18:39.399748"], ["title", "adf"], ["updated_at", "2014-05-07 07:18:39.399748"]]

	def update
		@post = Post.find(params[:id])
		if @post.update_attributes(user_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "content" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 6  [["content", "asdffasdfasdfasdf"], ["title", "asdfasdfasdfasd"], ["updated_at", "2014-05-07 08:48:16.790461"]]